### Short intro

Few queries to get used to the Pandas

In [2]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
from pandas import Series, DataFrame
%matplotlib inline

In [3]:
customers = pd.read_csv("customer.txt", sep='\t')

In [4]:
orders = pd.read_csv("orders.txt", encoding='cp1251', sep='\t')

In [4]:
customers.head(3)

   customerid  householdid gender firstname
0      174596     53949999      M    DANIEL
1       68239     49927024      M       JIM
2       10203     20914414      F     DONNA

In [5]:
orders.head(3)

,orderid,customerid,campaignid,orderdate,city,state,zipcode,paymenttype,totalprice,numorderlines,numunits
0,1002854,45978,2141,2009-10-13 00:00:00,NEWTON,MA,02459,VI,190.00,3,3
1,1002855,125381,2173,2009-10-13 00:00:00,NEW ROCHELLE,NY,10804,VI,10.00,1,1
2,1002856,103122,2141,2011-06-02 00:00:00,MIAMI,FL,33137,AE,35.22,2,2

5 queries for Series

Get all customerid who are men

In [66]:
customers[customers.gender == 'M'].customerid

0         174596
1          68239
4          68099
6         173506
9         174650
10        174273
13        174608
14        138942
15         67973
18        174628
20        167813
24        174630
25        174302
26         16268
27        174289
31        174267
33         68245
36        117354
37        174593
38        174423
40         70437
43        174295
46        155053
48        174766
50        147596
51         52009
53         56023
56        174746
57        174714
59        176424
           ...
189506    174194
189507    168589
189508    155722
189509    174534
189510    164899
189511    173752
189513     68246
189514    174300
189515    174482
189521     43239
189522     29028
189525     42727
189530    174301
189532    174285
189534     67968
189535     78130
189536    174636
189539    174275
189540    174625
189541    174483
189542    174276
189547    173750
189549    174649
189550     45929
189551    174592
189554    174268
189555    174594
189556    139779
189557    174256
189558    163204
Name: customerid, Length: 96481, dtype: int64

Count all the JIMs

In [18]:
customers[customers.firstname == 'JIM'].customerid.count()

286

Maximum of the totalprice from the orders database

In [19]:
orders.totalprice.max()

9848.96

Do all clients are in orders database?

In [5]:
S1 = set(customers.customerid)
S2 = set(orders.customerid)
Diff = S1.difference(S2)
len(Diff) == 0

True

Get all distinct names from customers

In [6]:
pd.Series(customers.firstname.unique())

0            DANIEL
1               JIM
2             DONNA
3             DIONE
4            TRISHA
5             DANTE
6           ANTHONY
7             NANCY
8              GREG
9            NORMAN
10               C.
11         TERESITA
12          DOUGLAS
13          RICHARD
14             MIKE
15         MARGARET
16            TERRY
17             NICK
18          DEBORAH
19             ALAN
20          BARBARA
21              NaN
22             KAYE
23               T.
24           ALFRED
25             JOHN
26            SHYAM
27        PRISCILLA
28            DIANE
29          ROBERTA
            ...
10116        VIRGIE
10117          KUNO
10118       TERILYN
10119        ITAMAR
10120      WERONIKA
10121      LEIGHANN
10122        SHEWIN
10123       KHOSROW
10124    JEANMAIRIE
10125      VIVIANNE
10126         SIJUN
10127         RUBLE
10128        GRATIA
10129       SILVIJA
10130          DAHL
10131         GONCA
10132      FERANADO
10133        GUYLER
10134         ELOIS
10135        ILARIA
10136        SUTTON
10137          DUNN
10138        ASTLEY
10139      THERESIA
10140         CHINA
10141         STEIG
10142        ANNICK
10143          ANDA
10144        BERRIE
10145       SHIGERU
Length: 10146, dtype: object

25 queries for DataFrame